# SegmentCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidCurveIntersection..::..SegmentCount Property
SolidCurveIntersection Class See Also
---
The number of segments in the results.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int SegmentCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SegmentCount As Integer
	Get
```

Visual C++
---
```text
public:
property int SegmentCount {
	int get ();
}
```

# See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace